#### Production Terraform Plan 🚀
<details><summary>Plan: 3 to add, 0 to change, 1 to destroy. (Click to expand details)</summary>

```terraform
module.infrastructure.module.ingestion.aws_ecr_repository.ingestion_lambda: Refreshing state... [id=currency-converter-api-ingestion-lambda-production]
module.infrastructure.module.ingestion.aws_s3_bucket.data_storage_bucket: Refreshing state... [id=currency-converter-api-data-storage-bucket-production]
module.infrastructure.module.ingestion.aws_ecr_lifecycle_policy.ingestion_lambda: Refreshing state... [id=currency-converter-api-ingestion-lambda-production]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.infrastructure.module.ingestion.aws_ecr_lifecycle_policy.ingestion_lambda must be replaced
-/+ resource "aws_ecr_lifecycle_policy" "ingestion_lambda" {
      ~ id          = "currency-converter-api-ingestion-lambda-production" -> (known after apply)
      ~ policy      = jsonencode(
          ~ {
              ~ rules = [
                  ~ {
                      ~ description  = "Delete untagged images to save costs" -> "Protect the active image"
                      ~ selection    = {
                          + tagPrefixList = [
                              + "latest",
                            ]
                          ~ tagStatus     = "untagged" -> "tagged"
                            # (2 unchanged attributes hidden)
                        }
                        # (2 unchanged attributes hidden)
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep only the 5 most recent images (Total)"
                      + rulePriority = 2
                      + selection    = {
                          + countNumber = 5
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            } # forces replacement
        )
      ~ registry_id = "756316131141" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.infrastructure.module.ingestion.aws_iam_role.ingestion_lambda will be created
  + resource "aws_iam_role" "ingestion_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "currency-converter-api-ingestion-lambda-role-production"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Application" = "currency-converter-api"
          + "Environment" = "production"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.infrastructure.module.ingestion.aws_iam_role_policy_attachment.lambda_logs will be created
  + resource "aws_iam_role_policy_attachment" "lambda_logs" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "currency-converter-api-ingestion-lambda-role-production"
    }

Plan: 3 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```
</details>

*Pushed by: @Ryhhill1998, Action: `pull_request`*